{
    "format": "layers-model",
    "generatedBy": "keras v2.6.0",
    "convertedBy": "TensorFlow.js Converter v3.21.0",
    "modelTopology": {
        "keras_version": "2.6.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "stem_conv1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "stem_conv1",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "stem_bn1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "stem_bn1",
                        "inbound_nodes": [
                            [
                                [
                                    "stem_conv1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation",
                        "inbound_nodes": [
                            [
                                [
                                    "stem_bn1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "reduction_conv_1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "reduction_conv_1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "reduction_bn_1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "reduction_bn_1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "reduction_conv_1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_1",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_1",
                        "inbound_nodes": [
                            [
                                [
                                    "reduction_bn_1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_3",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_3",
                        "inbound_nodes": [
                            [
                                [
                                    "stem_bn1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "separable_conv_1_pad_reduction_left1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "padding": [
                                [
                                    2,
                                    2
                                ],
                                [
                                    2,
                                    2
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "separable_conv_1_pad_reduction_left1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "separable_conv_1_pad_reduction_right1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "padding": [
                                [
                                    3,
                                    3
                                ],
                                [
                                    3,
                                    3
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "separable_conv_1_pad_reduction_right1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_1_reduction_left1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 24
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv_1_reduction_left1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_pad_reduction_left1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_1_reduction_right1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 29
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv_1_reduction_right1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_pad_reduction_right1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "separable_conv_1_bn_reduction_left1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "separable_conv_1_bn_reduction_left1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_reduction_left1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "separable_conv_1_bn_reduction_right1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "separable_conv_1_bn_reduction_right1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_reduction_right1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_2",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_2",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_bn_reduction_left1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_4",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_4",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_bn_reduction_right1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_2_reduction_left1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 46
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv_2_reduction_left1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_2_reduction_right1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 51
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv_2_reduction_right1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_5",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_5",
                        "inbound_nodes": [
                            [
                                [
                                    "stem_bn1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "separable_conv_2_bn_reduction_left1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "separable_conv_2_bn_reduction_left1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_2_reduction_left1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "separable_conv_2_bn_reduction_right1_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "separable_conv_2_bn_reduction_right1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_2_reduction_right1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "separable_conv_1_pad_reduction_right2_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "padding": [
                                [
                                    3,
                                    3
                                ],
                                [
                                    3,
                                    3
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "separable_conv_1_pad_reduction_right2_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_7",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_7",
                        "inbound_nodes": [
                            [
                                [
                                    "stem_bn1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "reduction_add_1_stem_1",
                            "trainable": false,
                            "dtype": "float32"
                        },
                        "name": "reduction_add_1_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_2_bn_reduction_left1_stem_1",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "separable_conv_2_bn_reduction_right1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_1_reduction_right2_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 70
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "separable_conv_1_reduction_right2_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_pad_reduction_right2_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ZeroPadding2D",
                        "config": {
                            "name": "separable_conv_1_pad_reduction_right3_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "padding": [
                                [
                                    2,
                                    2
                                ],
                                [
                                    2,
                                    2
                                ]
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "separable_conv_1_pad_reduction_right3_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_9",
                            "trainable": false,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "activation_9",
                        "inbound_nodes": [
                            [
                                [
                                    "reduction_add_1_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "separable_conv_1_bn_reduction_right2_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.9997,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "separable_conv_1_bn_reduction_right2_stem_1",
                        "inbound_nodes": [
                            [
                                [
                                    "separable_conv_1_reduction_right2_stem_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "separable_conv_1_reduction_right3_stem_1",
                            "trainable": false,
                            "dtype": "float32",
                            "filters": 11,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 82
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
